Revit 2024 API
ReferencePointArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ReferencePointArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ReferencePointArrayIterator
Visual C++
public:
virtual ReferencePointArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace